ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_Display.cpp
bool m_STM32F7_DisplayOutputEnableIsFixed = false;
bool m_STM32F7_DisplayOutputEnablePolarity = false;
bool m_STM32F7_DisplayPixelPolarity = false;
bool m_STM32F7_DisplayHorizontalSyncPolarity = false;
bool m_STM32F7_DisplayVerticalSyncPolarity = false;
bool m_STM32F7_DisplayEnable = false;

uint16_t* m_STM32F7_Display_VituralRam = nullptr;
size_t m_STM32F7_DisplayBufferSize = 0;

uint8_t m_STM32F7_Display_TextBuffer[LCD_MAX_COLUMN][LCD_MAX_ROW];

STM32F7xx_LCD_Rotation m_STM32F7_Display_CurrentRotation = STM32F7xx_LCD_Rotation::rotateNormal_0;

bool STM32F7_Display_Initialize();
bool STM32F7_Display_Uninitialize();
bool STM32F7_Display_SetPinConfiguration(bool enable);

void STM32F7_Display_WriteFormattedChar(uint8_t c);
void STM32F7_Display_WriteChar(uint8_t c, int32_t row, int32_t col);
void STM32F7_Display_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]);
void STM32F7_Display_PaintPixel(uint32_t x, uint32_t y, uint8_t c);
void STM32F7_Display_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p);
void STM32F7_Display_TextEnterClearMode();
void STM32F7_Display_PrintChracter(uint32_t x, uint32_t y, uint8_t c);
void STM32F7_Display_TextShiftColUp();
void STM32F7_Display_Clear();
void STM32F7_Display_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight);

int32_t STM32F7_Display_GetWidth();
int32_t STM32F7_Display_GetHeight();
int32_t STM32F7_Display_BitPerPixel();
uint32_t STM32F7_Display_GetPixelClockDivider();
int32_t STM32F7_Display_GetOrientation();
uint32_t* STM32F7_Display_GetFrameBuffer();

#define TOTAL_DISPLAY_CONTROLLERS 1

static TinyCLR_Display_Controller displayControllers[TOTAL_DISPLAY_CONTROLLERS];
static TinyCLR_Api_Info displayApi[TOTAL_DISPLAY_CONTROLLERS];

bool STM32F7_Ltdc_Initialize(LTDC_HandleTypeDef *hltdc) {
    uint32_t tmp = 0, tmp1 = 0;

    /* Check the LTDC peripheral state */
    if (hltdc == nullptr) {
        return false;
    }

    /* Configures the HS, VS, DE and PC polarity */
    hltdc->Instance->GCR &= ~(LTDC_GCR_HSPOL | LTDC_GCR_VSPOL | LTDC_GCR_DEPOL | LTDC_GCR_PCPOL);
    hltdc->Instance->GCR |= (uint32_t)(hltdc->Init.HSPolarity | hltdc->Init.VSPolarity | \
        hltdc->Init.DEPolarity | hltdc->Init.PCPolarity);

    /* Sets Synchronization size */
    hltdc->Instance->SSCR &= ~(LTDC_SSCR_VSH | LTDC_SSCR_HSW);
    tmp = (hltdc->Init.HorizontalSync << 16);
    hltdc->Instance->SSCR |= (tmp | hltdc->Init.VerticalSync);

    /* Sets Accumulated Back porch */
    hltdc->Instance->BPCR &= ~(LTDC_BPCR_AVBP | LTDC_BPCR_AHBP);
    tmp = (hltdc->Init.AccumulatedHBP << 16);
    hltdc->Instance->BPCR |= (tmp | hltdc->Init.AccumulatedVBP);

    /* Sets Accumulated Active Width */
    hltdc->Instance->AWCR &= ~(LTDC_AWCR_AAH | LTDC_AWCR_AAW);
    tmp = (hltdc->Init.AccumulatedActiveW << 16);
    hltdc->Instance->AWCR |= (tmp | hltdc->Init.AccumulatedActiveH);

    /* Sets Total Width */
    hltdc->Instance->TWCR &= ~(LTDC_TWCR_TOTALH | LTDC_TWCR_TOTALW);
    tmp = (hltdc->Init.TotalWidth << 16);
    hltdc->Instance->TWCR |= (tmp | hltdc->Init.TotalHeigh);

    /* Sets the background color value */
    tmp = ((uint32_t)(hltdc->Init.Backcolor.Green) << 8);
    tmp1 = ((uint32_t)(hltdc->Init.Backcolor.Red) << 16);
    hltdc->Instance->BCCR &= ~(LTDC_BCCR_BCBLUE | LTDC_BCCR_BCGREEN | LTDC_BCCR_BCRED);
    hltdc->Instance->BCCR |= (tmp1 | tmp | hltdc->Init.Backcolor.Blue);

    /* Enable the transfer Error interrupt */
    hltdc->Instance->IER |= LTDC_IER_TERRIE;

    /* Enable the FIFO underrun interrupt */
    hltdc->Instance->IER |= LTDC_IER_FUIE;

    /* Enable LTDC by setting LTDCEN bit */
    hltdc->Instance->GCR |= LTDC_GCR_LTDCEN;

    return true;
}

void STM32F7_Ltdc_SetConfiguration(LTDC_HandleTypeDef *hltdc, LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx) {
    uint32_t tmp = 0;
    uint32_t tmp1 = 0;
    uint32_t tmp2 = 0;

    /* Configures the horizontal start and stop position */
    tmp = ((pLayerCfg->WindowX1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16)) << 16);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((pLayerCfg->WindowX0 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16) + 1) | tmp);

    /* Configures the vertical start and stop position */
    tmp = ((pLayerCfg->WindowY1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR = ((pLayerCfg->WindowY0 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1) | tmp);

    /* Specifies the pixel format */
    LTDC_LAYER(hltdc, LayerIdx)->PFCR &= ~(LTDC_LxPFCR_PF);
    LTDC_LAYER(hltdc, LayerIdx)->PFCR = (pLayerCfg->PixelFormat);

    /* Configures the default color values */
    tmp = ((uint32_t)(pLayerCfg->Backcolor.Green) << 8);
    tmp1 = ((uint32_t)(pLayerCfg->Backcolor.Red) << 16);
    tmp2 = (pLayerCfg->Alpha0 << 24);
    LTDC_LAYER(hltdc, LayerIdx)->DCCR &= ~(LTDC_LxDCCR_DCBLUE | LTDC_LxDCCR_DCGREEN | LTDC_LxDCCR_DCRED | LTDC_LxDCCR_DCALPHA);
    LTDC_LAYER(hltdc, LayerIdx)->DCCR = (pLayerCfg->Backcolor.Blue | tmp | tmp1 | tmp2);

    /* Specifies the constant alpha value */
    LTDC_LAYER(hltdc, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
    LTDC_LAYER(hltdc, LayerIdx)->CACR = (pLayerCfg->Alpha);

    /* Specifies the blending factors */
    LTDC_LAYER(hltdc, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
    LTDC_LAYER(hltdc, LayerIdx)->BFCR = (pLayerCfg->BlendingFactor1 | pLayerCfg->BlendingFactor2);

    /* Configures the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (pLayerCfg->FBStartAdress);

    if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888) {
        tmp = 4;
    }
    else if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB888) {
        tmp = 3;
    }
    else if ((pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB4444) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB565) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB1555) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_AL88)) {
        tmp = 2;
    }
    else {
        tmp = 1;
    }

    /* Configures the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR = (((pLayerCfg->ImageWidth * tmp) << 16) | (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * tmp) + 3));

